;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el
;;;
(package! ebdb) ;; mangae contacts
(package! emms) ;; Manage music
;; (package! ess) ;; R in emacs
(package! evil-numbers) ; Increment numbers as in vim
(package! exwm) ;; Emacs as a windows manager
(package! gist) ; Github gist
(package! keychain-environment) ;; Avoid typing SSH passphrase
(package! ob-async) ; Execute code block asynchronsly
(package! openwith) ;; open PDF automatically
(package! org-chef) ; Get recipes in org mode
;; (package! org-ml) ; Functionnal programming in org
(package! org-ref) ;; Manage a reading list. Error with void function....
(package! org-roam) ;; Note-taking workflow
(package! org-super-agenda) ;; Better agenda : group by tags and so on
(package! projectile-ripgrep) ; I like ripgrep
(package! frog-jump-buffer) ; switch buffers, fast
;; (package! simple-mpc) ;
(package! yasnippet-snippets) ; List of snippets

;;; Examples:

;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)
