;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el
;;;

(package! ebdb) ;; mangae contacts
(package! evil-numbers) ; Increment numbers as in vim
(package! frog-jump-buffer) ; switch buffers, fast
(package! golden-ratio)
(package! helm-org-rifle)
(package! keychain-environment) ;; Avoid typing SSH passphrase
(package! openwith) ;; open PDF automatically
(package! org-chef) ; Get recipes in org mode
(package! org-ml) ; Functionnal programming in org
(package! org-ref) ;; Manage a reading list. Error with void function....
(package! org-roam) ;; Note-taking workflow
(package! org-super-agenda) ;; Better agenda : group by tags and so on
(package! projectile-ripgrep) ; I like ripgrep
(package! frog-jump-buffer) ; switch buffers, fast
(package! mode-line-stats :recipe (:host nil :repo "https://github.com/Idorobots/mode-line-stats")) ;; does not work
(package! yasnippet-snippets) ; List of snippets
;; (package! ob-async) ; Execute code block asynchronsly
